claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
       return TRUE;
}

bool Check_DS1307(void)
{
   // Read  address 0x08 from DS1307 if not 0XAA clock is not set
       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0)) return FALSE;
       if(!I2C_WD(0x08)) return FALSE;
       I2C_GenerateSTOP(ENABLE);
        //Last read byte by I2C slave
       if (!I2C_Start()) return FALSE;
       if(!I2C_RA(0xD0))return FALSE;
       I2C_AcknowledgeConfig(I2C_ACK_CURR);
       u8 data = I2C_RD();
       I2C_AcknowledgeConfig(I2C_ACK_NONE);
       I2C_GenerateSTOP(ENABLE);
       if (data != 0xAA) return FALSE;
       else return TRUE;
}

bool Set_DS1307()
{
       // convert hex or decimal to bcd format


       error=0;
       if (!I2C_Start()) return FALSE;
       if(!I2C_WA(0xD0)) return FALSE;
       if(!I2C_WD(0x00)) return FALSE;
       if(!I2C_WD(convert_tobcd(seconds))) return FALSE;
       if(!I2C_WD(convert_tobcd(minutes))) return FALSE;
       if(!I2C_WD(convert_tobcd(hours))) return FALSE;
       if(!I2C_WD(convert_tobcd(days))) return FALSE;
       if(!I2C_WD(convert_tobcd(date))) return FALSE;
       if(!I2C_WD(convert_tobcd(month))) return FALSE;
       if(!I2C_WD(convert_tobcd(year)))return FALSE;
       if(!I2C_WD(DS_Control))return FALSE;
       if(!I2C_WD(0XAA)) return FALSE;  // Byte --> time is set by program
       I2C_GenerateSTOP(ENABLE);


   return TRUE;
}


u8 convert_tobcd(u8 data)
{
   u8 data_second_decimal=data/10;
   u8 data_first_decimal=data - 10*data_second_decimal;
   data=16*data_second_decimal + data_first_decimal;
  return data;
}

u8 bcd2hex(u8 bcd)
{
  u8 hex=0;
  hex=(bcd>>4)*10 +(bcd&0x0f);
  bcd=0;
  return hex ;
}


bool Set_Clock()
{
    //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nYear>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",year,month,date);
       year=adj(0,99,year);
    } while (!key_ok_on());

     line_lcd=0;
    printf("\nMonth>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",year,month,date);
       month=adj(1,12,month);
    } while (!key_ok_on());

    LCDInstr(0x01);
     Delay1(1000);
      line_lcd=0;
    printf("\nDate>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",year,month,date);
       date=adj(1,31,date);
    } while (!key_ok_on());


    //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nDays>");
      do
    {
      line_lcd=1;
     printf("\n%02d",days);
       days=adj(1,7,days);
    } while (!key_ok_on());



   //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
    printf("\nHour>");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       hours=adj(0,23,hours);
    } while (!key_ok_on());

     line_lcd=0;
     printf("\nMinute>");
      do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       minutes=adj(0,59,minutes);
    } while (!key_ok_on());

    line_lcd=0;
    printf("\nSeconds>");
    do
    {
      line_lcd=1;
     printf("\n%02d:%02d:%02d",hours,minutes,seconds);
       seconds=adj(0,59,seconds);
    } while (!key_ok_on());

      // Set parameter to DS1307 + time byte
      Set_DS1307();

      //bool k=Check_DS1307();

  return TRUE;
}


u8 adj(u8 min,u8 max,u8 now)
{
   u8 adj=now;
   if (key_plus_on())
   {
     adj ++;
     timer3=0;
   }
   if (adj >max) adj = min;
   if (key_minus_on())
   {
     timer3=0;
     adj --;
   }
   if ( adj == 255) adj=max;
   if (adj < min) adj=max;

   return adj ;
}


bool key_ok_on()
{
  //Read Key OK
  if (!(GPIO_ReadInputData(GPIOF)& key_ok))
   {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time_ok) && !(GPIO_ReadInputData(GPIOF)& key_ok) );;
       if (timer2>=key_time_press) // min delay for one
       {
         timer2=0; // and next must be release
          if (GPIO_ReadInputData(GPIOF)& key_ok)  return TRUE;   //if realease retrun true
       }
   }

  return FALSE;
}



 bool key_plus_on()
{
  //Read Key OK
    if (!(GPIO_ReadInputData(GPIOA)& key_plus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_plus) );;
        if (timer2>=key_time_press)
        {
          if (GPIO_ReadInputData(GPIOF)& key_ok)  return TRUE;
        }
     }

  return FALSE;
}


  bool key_minus_on()
{
  //Read Key OK
   if (!(GPIO_ReadInputData(GPIOA)& key_minus))
     {
     timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !(GPIO_ReadInputData(GPIOA)& key_minus) );;
        if (timer2>=key_time_press)
        {
         if (GPIO_ReadInputData(GPIOF)& key_ok)  return TRUE;
        }
     }

  return FALSE;
}


bool  key_ok_plus()
{
  if (!((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)))
  {
      timer2=0;  // Key must be push for timer2 time
      while((timer2 < key_time) && !((GPIO_ReadInputData(GPIOF)& key_ok)|(GPIO_ReadInputData(GPIOA)& key_plus)));;
       if (timer2>=key_time) return TRUE;
  }

 return FALSE;
}


bool Set_Timer_On()
{

   //clr
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nH On>");
    timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_hour_on=adj(0,23,daily_hour_on);
    } while ( timer3<=time_menu && !key_ok_on());

   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin On>");
    timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
       daily_minute_on=adj(0,59,daily_minute_on);
    } while ((timer3<=time_menu)&& !key_ok_on());

   //Save data to eeprom
     if (!status.monthly) status.daily=1;
       else status.daily=0;
     EEPROM_INIT();
    //u8 temp =*(u8*)(&status);
    // FLASH_ProgramByte(EEPROM_ADR_STATUS,*(u8*)(&status)); //save Status to eeprom
     FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
     FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
     FLASH_ProgramByte(EEPROM_ADR_TIME_ON_HOURS,daily_hour_on);
     FLASH_ProgramByte(EEPROM_ADR_TIME_ON_MINUTES,daily_minute_on);
     FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
      time_on=daily_hour_on*60+daily_minute_on;
       change=TRUE;

