claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
   return TRUE;
}

bool Set_Timer_Off()
{

    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nH Off>");
     timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_hour_off=adj(0,23,daily_hour_off);
    } while (timer3<=time_menu && !key_ok_on());

  LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin Off>");
   timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_minute_off=adj(0,59,daily_minute_off);
    } while (timer3<=time_menu && !key_ok_on());

  //Save data to eeprom
     if (!status.monthly) status.daily=1;
       else status.daily=0;
     EEPROM_INIT();
    //u8 temp =*(u8*)(&status);
    // FLASH_ProgramByte(EEPROM_ADR_STATUS,*(u8*)(&status)); //save Status to eeprom
     FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
     FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
     FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_HOURS,daily_hour_off);
     FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_MINUTES,daily_minute_off);
     FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
      time_off= daily_hour_off*60+daily_minute_off;
       change=TRUE;
     return TRUE;
}

/*
     //Computing time_long_on

     u8 hour=daily_hour_on;
     u8 minute=daily_minute_on;
     daily_long_on=0;
     do
     {
          daily_long_on++;
          minute++;
          if (minute==60)
          {
            minute=0;
            hour++;
          }
          if(hour==24) hour=0;

     } while ( !((hour==daily_hour_off) & (minute==daily_minute_off)));

      //Display daily_long_on
    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nLong :");

      do
    {
     line_lcd=1;
     printf("\n%d",daily_long_on);
       //daily_long_on=adj(0,1440,daily_long_on);
    } while (!key_ok_on());

    time_on=daily_hour_on*60+daily_minute_on;
    time_off= daily_hour_off*60+daily_minute_off;
    //Save data to eeprom
      status.daily=1;
     EEPROM_INIT();
    //u8 temp =*(u8*)(&status);
    // FLASH_ProgramByte(EEPROM_ADR_STATUS,*(u8*)(&status)); //save Status to eeprom
     FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
     FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
     FLASH_ProgramByte(EEPROM_ADR_TIME_ON_HOURS,daily_hour_on);
     FLASH_ProgramByte(EEPROM_ADR_TIME_ON_MINUTES,daily_minute_on);
     FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_HOURS,daily_hour_off);
     FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_MINUTES,daily_minute_off);
     FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data

   return TRUE;

}
  */

void Save_Status()
{
  EEPROM_INIT();
  FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
  FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
  FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
}

bool Read_Allarm()
{
   daily_hour_on=FLASH_ReadByte(EEPROM_ADR_TIME_ON_HOURS);
    if(daily_hour_on > 24) return FALSE;
   daily_minute_on=FLASH_ReadByte(EEPROM_ADR_TIME_ON_MINUTES);
    if(daily_minute_on > 59) return FALSE;
   daily_hour_off=FLASH_ReadByte(EEPROM_ADR_TIME_OFF_HOURS);
    if(daily_hour_off > 24) return FALSE;
   daily_minute_off=FLASH_ReadByte(EEPROM_ADR_TIME_OFF_MINUTES);
    if(daily_hour_off > 59) return FALSE;
   monthly_year=FLASH_ReadByte(EEPROM_ADR_MONTH_YEAR);
    if(monthly_year >99) return FALSE;
   monthly_month=FLASH_ReadByte(EEPROM_ADR_MONTH_MONTH);
    if(monthly_month>12) return FALSE;
   monthly_date=FLASH_ReadByte(EEPROM_ADR_MONTH_DATE);
    if(monthly_date >31) return FALSE;
  return TRUE;
}

void EEPROM_INIT()
{
  FLASH_DeInit();
  FLASH_Unlock(FLASH_MEMTYPE_DATA);
  FLASH_SetProgrammingTime(FLASH_PROGRAMTIME_STANDARD);



}


void GpioConfiguration()
{

  GPIO_Init(LCD_PORT,(GPIO_Pin_TypeDef)LCD_GPIO_PIN,GPIO_MODE_OUT_PP_HIGH_FAST);

  // ADC PE6 NEW PB0
  GPIO_Init(GPIOB,GPIO_PIN_0,GPIO_MODE_IN_FL_NO_IT);

  // PD6/UART2_RX   PD5/UART2_TX  No need to init  PD7 485 R/W;
  GPIO_Init(GPIOD,GPIO_PIN_7,GPIO_MODE_OUT_PP_HIGH_FAST);

  //PD0 Led
  GPIO_Init(GPIOD,GPIO_PIN_0,GPIO_MODE_OUT_PP_HIGH_FAST);
  //I2C
  GPIO_Init(GPIOB,GPIO_PIN_4 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  GPIO_Init(GPIOB,GPIO_PIN_5 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  // Remap Pins pb4,pb5  sda,scl ;

   //Init KEY OK,PLUS,MINUS
  GPIO_Init(GPIOF,key_ok,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_plus,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_minus,GPIO_MODE_IN_PU_NO_IT);

  //Init DS18b20 data pin
  GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_OD_HIZ_FAST);

  // Power Pin
   GPIO_Init(GPIOD,power_pin,GPIO_MODE_OUT_PP_HIGH_FAST);

}

void InitClk()
{
  CLK_DeInit();
  CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV1);    // CPU Prescalar = 1.
  CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1);    // Prescalar = 1, 16 MHz.
  CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO,  // Automatically switch
  CLK_SOURCE_HSI,       // Switch to internal timer.
  DISABLE,              // Disable the clock switch interrupt.
  CLK_CURRENTCLOCKSTATE_DISABLE);   // Disable the previous clock.

  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2 , ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER3 , ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_UART2,ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_ADC,ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_I2C,ENABLE);


}


/*
void InitAdc()
{
     ADC1_DeInit();
     ADC1_StartConversion();

     //ADC1_Init(ADC1_CONVERSIONMODE_SINGLE,
     //           ADC1_CHANNEL_0,
     //           ADC1_PRESSEL_FCPU_D4,
     //            ADC1_EXTTRIG_TIM,


     ADC1_PrescalerConfig(ADC1_PRESSEL_FCPU_D3);
     ADC1_ConversionConfig( ADC1_CONVERSIONMODE_SINGLE,
                            ADC1_CHANNEL_0,
                            ADC1_ALIGN_RIGHT
                           );


     ADC1_SchmittTriggerConfig(ADC1_SCHMITTTRIG_CHANNEL0,DISABLE);


     //ADC1_Cmd (ENABLE);
     //ADC1->CR1 |= ADC1_CR1_ADON ;
     ADC1_StartConversion();
     ADC1_ITConfig (ADC1_IT_EOCIE,ENABLE);

