claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
  }
    enableInterrupts();
    //Init DS18b20 data pin
   // GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_OD_HIZ_FAST);
   return data;
}

bool DS18_Reset()
{
   //Init Reset Pulse
    DS18(0);
    Delay1(25);    //25=524us
    DS18(1);
    //Delay1(1);
    timer2=0;
    while ((timer2 < TIMEOUT_DS18B20) && (GPIO_ReadInputPin(GPIOD, ds18_data)));;   //Wait for ack from DS18B20
    if (timer2>=TIMEOUT_DS18B20)
    {
      ds_temperature=FALSE;
      return FALSE;
    }

    timer2=0; // Then Wait for Release bus set to One
     while ((timer2 < TIMEOUT_DS18B20) && (!GPIO_ReadInputPin(GPIOD, ds18_data)));;
      if (timer2>=TIMEOUT_DS18B20)
       {
        ds_temperature=FALSE;
        return FALSE;
       }

    // Delay1(10);
    //Delay1(20);    //25=524us
     ds_temperature=TRUE;
    return TRUE;
}

u8 temperature ()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < TIMEOUT_DS18B20) && !(DS18_Read()));;
      if (timer2>TIMEOUT_DS18B20) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
    DS18_Reset();
      u16 result = temp2*256+temp1;
      temp1= (u8)(result>>3);
     return temp1;
}

bool Read_DS18()
{

   //Init Reset Pulse
     if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  CONVERT T [44h]
    DS18_Write(0x44);
    //Wait util end convert
    timer2=0;
     while ((timer2 < TIMEOUT_DS18B20) && !(DS18_Read()));;
      if (timer2>TIMEOUT_DS18B20) return FALSE;
     //u8 temp8=timer2;
    //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
    // Skip ROM Command 0xCC
    DS18_Write(0xCC);
    //Function command READ SCRATCHPAD [BEh]
    DS18_Write(0xBE);
     u8 temp1=DS18_Read();
     u8 temp2=DS18_Read();
     u8 temp3=DS18_Read();
     u8 temp4=DS18_Read();
     u8 temp5=DS18_Read();
     u8 temp6=DS18_Read();
     u8 temp7=DS18_Read();
     u8 temp8=DS18_Read();
     u8 temp9=DS18_Read();

     DS18_Reset();

      line_lcd=0;
      result2=0;
      u16 result = temp2*256+temp1;
      result1= (u8)(result>>3);
      if(result1%2!=0) result2=5;
      result1 /=2;


      printf("\n%d.%d",result1,result2);
     // printf("\n%02x%02x%02x",temp1,temp2,temp5);
     //line_lcd=1;
     // printf("\n%02x%02x%02x",temp7,temp8,temp9);
     // while (!key_ok_on());

     //u8 temp3=DS18_Read();

    return TRUE;
}

bool DS18Set ()
{
     //Init Reset Pulse
    if(!DS18_Reset()) return FALSE;
   //Skip ROM Command 0xCC
    DS18_Write(0xCC);
   //Function command  WRITE SCRATCHPAD 0x4E
    DS18_Write(0x4E);
   //Write 3 bytes last is config reg
    DS18_Write(125);
    DS18_Write(0xDC); //-55
    DS18_Write(0x1F);




  return TRUE;
}








void Delay1(u16 Delay)
{
    //1 = 40us,2=60us,3=80us,10=200us, 15=320us,
  timer1=0;
  while ( timer1 < Delay); ;
}

 void Delay2(u16 Delay)
{
  timer2=0;
  while ( timer2 < Delay); ;
}


void Delay_us (u16 time) //1:3.2us,100:39us,200:77us,35:15.2us,120:45us,160:60us
{
  //disableInterrupts();
  do
    {
      time--;
      nop();
    }
    while (time);
  //enableInterrupts();
}


void Display_Line(char* line)
{
  char current_char= *line++;
  u8 count;
    //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
  do
  {

    if (current_char > 0x1b)   //Display only valid data
     {
       LCDData(current_char);
        Delay1(1);
       count++;
     }
     current_char=*line++;
  }  while ((current_char != 0x00) && (count<7));

   Rotate_Line(line1);

}

void Rotate_Line( char * line)
{

   char temp_first = *line;
   char temp_next;

   do
   {
      temp_next=*(line+1);
     *line++=temp_next;
      //line++;
      //temp_next=*line;
     //*line=*line++;
   } while (*line !=0);
   line--;
   *line=temp_first;

}

void Clear_Line1 ()
{
     //Set Cursor to First Line
   LCDInstr(0x80 | 0x00);
   count=0;
   Delay1(1);
    u8 count=0;
   do
   {
     LCDData(' ');
        Delay1(1);
        count++;
   }while (count<8);


}

void Clear_Line2 ()
{
     //Set Cursor to Second  Line
   LCDInstr(0x80 | 0x40);
   count=0;
   Delay1(1);
    u8 count=0;
   do
   {
     LCDData(' ');
        Delay1(1);
        count++;
   }while (count<8);


}





void Menu (void)
{
 // Clear Display
    LCDInstr(0x01); //Clear LCD
    Delay1(250);
    //u8 key;
 /* First Line 1. Time On 2. Time off 3.Timer ON/OFF 4.Exit
    Wait for Plus,Minius or OK
    If plus next option from Menu on the end EXIT
    If minus previous option from Menu  on the end EXIT
    If OK enter to menu option
    If time out about 10s exit from Menu
 */
    do {
First_Menu:
    line_lcd=0;
    printf("\nON      ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
    switch (Key_Press())
        {
        case 1: goto Second_Menu ;
         break;
        case 2: Set_Timer_On();
         break;
        case 3: goto Exit_Menu;
         break;
        }
        break; //Exit Menu


Second_Menu:
    line_lcd=0;
    printf("\nOFF     ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
      switch (Key_Press())
        {
        case 1: goto Third_Menu ;
         break;
        case 2: Set_Timer_Off();
         break;
        case 3: goto First_Menu;
         break;
        }
     break; //Exit Menu

Third_Menu:
      line_lcd=0;
    printf("\nMonthly ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",monthly_year,monthly_month,monthly_date);
      switch (Key_Press())
        {
        case 1: goto Fourth_Menu;
         break;
        case 2:
          {
           Set_Date();
           monthly_year=y;
           monthly_month=m;
           monthly_date=d;
           status.monthly=1;
           status.daily=0;  // Disable Daily Alarm On date enable it
           status.on=0;     // Power off
           // Save Status and Date in EEPROM
           EEPROM_INIT();
           FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
           FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
           FLASH_ProgramByte(EEPROM_ADR_MONTH_YEAR,y);
           FLASH_ProgramByte(EEPROM_ADR_MONTH_MONTH,m);
           FLASH_ProgramByte(EEPROM_ADR_MONTH_DATE,d);
           FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
           break;
          }
        case 3: goto Second_Menu ;
         break;
        }
     break; //Exit Menu


Fourth_Menu:
    line_lcd=0;
    printf("\nClock   ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",hours,minutes,seconds);
      switch (Key_Press())
        {
        case 1: goto Fifth_Menu ;
         break;
        case 2: Set_Clock();
         break;
        case 3: goto Third_Menu;
         break;
        }
     break; //Exit Menu


